// Math Object
result = Math.PI; // Просто число ПИ.
result = Math.round(3.1415); // Округляет число с привычками правилами.
result = Math.ceil(3.1); // Округляет всегда в большую сторону.
result = Math.floor(3.9); // Округляет всегда в меньшую сторону.
result = Math.sqrt(4); // Извлечения квадратного корня.
result = Math.abs(-99); // Абсолютное значение (модуль числа).
result = Math.pow(2, 10); // Возвести число в степень.
result = Math.min(3, 56, 31, 753, 334, 4); // Извлекает минимальное число.
result = Math.max(3, 56, 31, 753, 334, 4); // Извлекает максимальное число.
result = Math.random(); // Выдает случайное десятичное число (от 0 до 1).
result = Math.floor(Math.random() * 100) + 1; // Случайное число от 0 до 100.

console.log(result);